__Цель:__

Хранить в отдельной Таблице _(например, RecentSupplier)_ "историю" Поставщиков товара (SKU) на склад (Warehouse)

__Поля таблицы:__ 

- SKU {Product_id}
- Warehouse {Warehouse_id}
- SupplierCode {Supplier_id}
- Main {0,1} - флаг, Поставщик активный/неактивный - чтоб отслеживать изменения
- Date_beg - дата, когда Поставщик стал Активным 

а также, например:

- ItemDescription
- SupplierDimension
- SupplierUnitMultiplier

__Предположение:__

Изначально Таблица должна содержать информацию о Текущих активных поставщиках.
_т.к. при если Поставщик изменен вручную - предыдущее значение не сохранится_


__Триггер:__

1. Импорт из *.csv (плановый/внеплановый)
2. Выгрузка *.xls
3. Редактирование Поставщика через Интерфейс

__Логика:__

[Flowchart](https://www.dropbox.com/s/z0nb24g13u1rkfl/%D0%A1%D0%BD%D0%B8%D0%BC%D0%BE%D0%BA.PNG?dl=0)

1. Сравнить "новых" Поставщиков c данными из Таблицы. 
<br>Искать среди активных (флаг Main=1) по уникальному ключу SKU & Warehouse. _(на Main=0 поставщиков можно пока "забить")_.
Если все ровно -> Конец
2. Если появился новый Main поставщик для SKU & Warehouse _(для уникального ключа SKU & Warehouse)_

 - Поставщик есть среди неактивных (Main=0) -> меняем флаг активности Main=1, обновляем дату (Date_beg=TODAY)
 - Поставщик отсутствует с таблице RecentSupplier  -> добавляем новую запись в Таблицу. Задаем "новичку" флаг Main=1 _(это может быть значением по умолчанию для всех новых Поставщиков)_ и проставляем дату Date_beg=TODAY.

3. Старому (предыдущему) Поставщику изменить статус (флаг Main=0)
